In [1]:
import pandas as pd

In [5]:
df = pd.DataFrame({ 
    'name' : ['Tom','harry','bob','henry','harley'],
    'marks': [90,87,89,92,90]
})

In [20]:
df['student_rank'] = df['marks'].rank(method = 'average',ascending = False)

In [21]:
df

     name  marks  student_rank
0     Tom     90           2.5
1   harry     87           5.0
2     bob     89           4.0
3   henry     92           1.0
4  harley     90           2.5

In [24]:
df['student_rank'] = df['marks'].rank(method = 'max',ascending = False)

In [25]:
df

     name  marks  student_rank
0     Tom     90           3.0
1   harry     87           5.0
2     bob     89           4.0
3   henry     92           1.0
4  harley     90           3.0

In [26]:
df['student_rank'] = df['marks'].rank(method = 'min',ascending = False)

In [27]:
df

     name  marks  student_rank
0     Tom     90           2.0
1   harry     87           5.0
2     bob     89           4.0
3   henry     92           1.0
4  harley     90           2.0

In [28]:
df['student_rank'] = df['marks'].rank(method = 'first',ascending = False)

In [29]:
df

     name  marks  student_rank
0     Tom     90           2.0
1   harry     87           5.0
2     bob     89           4.0
3   henry     92           1.0
4  harley     90           3.0

In [30]:
df['student_rank'] = df['marks'].rank(method = 'dense',ascending = False)

In [31]:
df

     name  marks  student_rank
0     Tom     90           2.0
1   harry     87           4.0
2     bob     89           3.0
3   henry     92           1.0
4  harley     90           2.0

In [32]:
df["rank"] = df["marks"].rank(method="dense", ascending=False)
df[df["rank"] <= 3]

     name  marks  student_rank  rank
0     Tom     90           2.0   2.0
2     bob     89           3.0   3.0
3   henry     92           1.0   1.0
4  harley     90           2.0   2.0